# Short introduction to pandas

Pandas is a Python library for data manipulation and analysis that is characterized by great flexibility but also speed. Pandas was written in Python but critical parts were written in Cython and C to achieve great speed. This chapter will describe the two essential data structures that Pandas has at its disposal, the Series and DataFrame. For starters, we need to load `pandas`, and often `numpy` numpy as well.

Additional resources:
- [Installing jupyter notebook](https://jupyter.org/install)
- [Cheatsheet for Pandas](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [10-minute introduction](https://pandas.pydata.org/docs/user_guide/10min.html#min)
- [Pandas official guide](https://pandas.pydata.org/docs/user_guide/index.html)

Additional questions to filip.tomas@fer.hr.

In [7]:
import pandas as pd
import numpy as np

## Short introduction to different data types and structures

Python and other programing languages use variables to store information to be referenced and manipulated in a program. These variables can differe in type, allowing for different operations being performed on them. Python implicitly "guesses" the type of variable based on the value.

Here are some examples of the data types used in this exercise.

In [1]:
example_int = 3 
print(f"example_int is of type: {type(example_int)}") # integer(int) - whole numbers
example_float = 3.0
print(f"example_float is of type: {type(example_float)}") # float - decimal numbers

example_string = "Some string" 
print(f"example_string is of type: {type(example_string)}") # string - letters and/or numbers circumvented with " " or ' ' signs


example_boolean = True 
print(f"example_boolean is of type: {type(example_boolean)}") # bool - bollean algebra values (True or False)

example_int is of type: <class 'int'>
example_float is of type: <class 'float'>
example_string is of type: <class 'str'>
example_boolean is of type: <class 'bool'>

Python also allows for explicit definition of a data type or for conversion between some types.

In [2]:
explicit_float = float(3.0)

explicit_float

3.0

In [3]:
integer_from_float = int(example_float)

integer_from_float

3

In Python, a list is an ordered collection of items that can be of different data types, enclosed in square brackets. \
Enteries can be added or removed from a list.

In [4]:
some_list = ["This", 3, True]
some_list

['This', 3, True]

In [5]:
some_list.append('Some new data')
some_list.remove(3)
some_list

['This', True, 'Some new data']

While flexible, lists don't allow for the usage mathematical operations on the data, such as vector or matrix multiplication.\
Numpy arrays are a data type which allows for such operations, limitation being that all enteries must be of the same datatype.\
To initialize a numpy array use the np.array() function.

In [8]:
another_list = [2, 3, 4]
array_from_list = np.array(another_list, dtype = 'int32')

array_from_list

array([2, 3, 4])

Arrays can also be multidimensional

In [9]:
example_2d_array = np.array([[1,2,3],[4,5,6],[7,8,9]], dtype = 'int32')

example_2d_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

Dictionary is an unordered collection of key-value pairs, enclosed in curly braces, allowing efficient retrieval of values based on their associated keys.

In [10]:
example_dict = {"Name" : "Filip", "Age" : 28}

example_dict

{'Name': 'Filip', 'Age': 28}

## Series 

Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

```py
>>> s = pd.Series(data, index=index)
```

Here `data` can be many different things
- Python `dict`
- `ndarray`
- scalar

`index` is a list of axis names.

The Series object behaves similarly to numpy `ndarray`, i.e. it is possible to perform most NumPy functions and vector operations (addition, vector multiplication, summation, ...) on it, but more on that in future laboratory exercises. In addition, the Series object is similar to the Python `dict` object, i.e. it is possible to easily retrieve a value on the index with e.g.

`s["a"]` or `s.get("f", np.nan)`

### 1. Initilizing with a `ndarray`

In [11]:
# with implicit index
print(np.arange(5))
pd.Series(np.arange(5))

[0 1 2 3 4]

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [12]:
# with explicit index (same length as data)
pd.Series(np.arange(5), index=["a", "b", "c", "d", "e"])

a    0
b    1
c    2
d    3
e    4
dtype: int32

### 2. Initilizing with a `dict`

In [13]:
d = {"b": 1, "a": 0, "c": 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [14]:
d = {"a": 0.0, "b": 1.0, "c": 2.0}
pd.Series(d, index=["b", "c", "d", "a"])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

### 3. Initilizing with a scalar

In this case the `index` argument is necessary and the value is repeated up to the length of the` index` argument.

In [15]:
pd.Series(5.0, index=["a", "b", "c", "d", "e"])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

## DataFrame

`DataFrame` is a two-dimensional labeled data structure with columns that differ by data type. `DataFrame` can be viewed as a spreadsheet or `dict` that contains `Series` objects as values. `DataFrame is the most commonly used pandas object and can be created using a variety of:
- `dict` of one-dimensional `ndarray`, `dict` or `Series` objects
- 2D `ndarray`
- Structured `ndarray`
- `Series` object
- other `DataFrame`

In addition to the `data` argument, an additional `index` (row labels) or `columns` (column labels) can be sent

In [21]:
d = np.array([[1,2,3],[4,5,6]], dtype = 'int32')

pd.DataFrame(d)

   0  1  2
0  1  2  3
1  4  5  6

In [22]:
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}

pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [23]:
pd.DataFrame(d, index=["d", "b", "a"])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [24]:
pd.DataFrame(d, index=["d", "b", "a"], columns=["two", "three"])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [25]:
pd.DataFrame({
    "one": [1.0, 2.0, 3.0, 4.0], 
    "two": [4.0, 3.0, 2.0, 1.0]
})

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [26]:
pd.DataFrame([
    {"a": 1, "b": 2}, 
    {"a": 5, "b": 10, "c": 20}
])

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [27]:
pd.DataFrame([
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]],
    index=['a', 'b', 'c'], 
    columns=["first", "second", "third"]
)

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

# Data sources

Pandas can work with a lot of data sources as long as the data can be written using the two object types listed in the previous chapter. In this exercise, the focus will be on the data written in the spreadsheet, .csv file. The `data` directory contains .csv and .xlsx example files. Both tables contain the same data.

Loading data with the Pandas library is often very easy when the data is in the correct format, this will be shown below in the exercise for the three sources mentioned. For more information on `pandas` functions for reading and storing data and working with other formats, see https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html.

## CSV
A CSV (Comma Separated Values) file is a text file in which a comma is used to separate values. Each line in the file represents a new record. The record consists of several fields separated by commas. The first line is often used to specify field names that are also comma separated. CSV files are a simple way to write structured data and are therefore often used in practice.

This exercise uses the sample file `data / students.csv` which is loaded using the` read_csv` function using the `pandas` library. Additional options for this feature may be available at [https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html).

In [29]:
students = pd.read_csv("data/students.csv")

students

    ID                 name    JMBAG  grade  repeating
0    0  Jeanette Washington  1230001      3          0
1    1        Kellie Carter  1230002      3          0
2    2       Armando Cooper  1230003      4          0
3    3         Tamara Dixon  1230004      5          0
4    4         Rufus Bishop  1230005      3          0
5    5     Stewart Sandoval  1230006      4          1
6    6            Brian May  1230007      3          0
7    7         Felix Morton  1230008      3          0
8    8       Jessica Hughes  1230009      3          1
9    9      Maureen Chapman  1230010      4          0
10  10             Dana Ray  1230011      3          1
11  11        Clay Mccarthy  1230012      3          1
12  12       Kristen Garcia  1230013      3          0
13  13        Angie Stewart  1230014      4          0
14  14        Dana Erickson  1230015      5          0
15  15          Erma Ortega  1230016      3          0
16  16         Karen Obrien  1230017      3          1
17  17      Angelo Mitchell  1230018      3          1
18  18       Barbara Porter  1230019      2          0
19  19          Luz Douglas  1230020      2          0
20  20         Melinda Ross  1230021      3          1
21  21        Oliver Potter  1230022      3          1
22  22        Jennie Haynes  1230023      3          1
23  23         Jimmie Poole  1230024      5          0
24  24     Emanuel Jennings  1230025      3          0

## Spreadsheets

Spreadsheets are often used to work with spreadsheets and provide many additional services useful to data scientists, but sometimes it is necessary to process the data contained in such spreadsheets using the Python programming language. In this case, these tables are easy to load using the `pandas` function` read_excel()`.

For the purposes of this laboratory exercise, the file `data/students.xlsx` is used, from which the `students` table is loaded.

Additional information about the `read_excel()` function and its options is available at [https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html?highlight=read_excel](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html?highlight=read_excel).

In [30]:
pd.read_excel("data/data.xlsx", sheet_name="students")

C:\Users\Sandra\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:79: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():

    ID                 name    JMBAG  grade  repeating
0    0  Jeanette Washington  1230001      4          0
1    1        Kellie Carter  1230002      4          0
2    2       Armando Cooper  1230003      4          0
3    3         Tamara Dixon  1230004      5          1
4    4         Rufus Bishop  1230005      4          1
5    5     Stewart Sandoval  1230006      3          0
6    6            Brian May  1230007      3          1
7    7         Felix Morton  1230008      3          1
8    8       Jessica Hughes  1230009      4          1
9    9      Maureen Chapman  1230010      4          1
10  10             Dana Ray  1230011      3          1
11  11        Clay Mccarthy  1230012      2          1
12  12       Kristen Garcia  1230013      5          0
13  13        Angie Stewart  1230014      3          1
14  14        Dana Erickson  1230015      4          1
15  15          Erma Ortega  1230016      2          0
16  16         Karen Obrien  1230017      3          1
17  17      Angelo Mitchell  1230018      4          1
18  18       Barbara Porter  1230019      3          1
19  19          Luz Douglas  1230020      4          0
20  20         Melinda Ross  1230021      3          0
21  21        Oliver Potter  1230022      3          1
22  22        Jennie Haynes  1230023      5          0
23  23         Jimmie Poole  1230024      3          1
24  24     Emanuel Jennings  1230025      2          0

# Manipulating Pandas DataFrame data

### example 1

Select columns 'JMBAG' and 'grade'.

In [31]:
students[["JMBAG", "grade"]]

      JMBAG  grade
0   1230001      3
1   1230002      3
2   1230003      4
3   1230004      5
4   1230005      3
5   1230006      4
6   1230007      3
7   1230008      3
8   1230009      3
9   1230010      4
10  1230011      3
11  1230012      3
12  1230013      3
13  1230014      4
14  1230015      5
15  1230016      3
16  1230017      3
17  1230018      3
18  1230019      2
19  1230020      2
20  1230021      3
21  1230022      3
22  1230023      3
23  1230024      5
24  1230025      3

### example 2
Select entries where the student's grade is greater than 3.

In [32]:
students[students.grade > 3]

    ID              name    JMBAG  grade  repeating
2    2    Armando Cooper  1230003      4          0
3    3      Tamara Dixon  1230004      5          0
5    5  Stewart Sandoval  1230006      4          1
9    9   Maureen Chapman  1230010      4          0
13  13     Angie Stewart  1230014      4          0
14  14     Dana Erickson  1230015      5          0
23  23      Jimmie Poole  1230024      5          0

What is the result of students.grade > 3?

In [33]:
students.grade > 3
# students['grade'] > 3

0     False
1     False
2      True
3      True
4     False
5      True
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23     True
24    False
Name: grade, dtype: bool

This type of entery selection is also called boolean indexing as only the enteries for which the condition is True are selected.

### example 3

Another example of boolean indexing, this time with 2 conditions: select enteries where the student's grade is equal to 5 and the student hasn't been repeating the course. Additionally only the 'JMBAG' column is selected.

In [34]:
students[
    (students.grade == 5) &
    (students.repeating == False)
]["JMBAG"]

3     1230004
14    1230015
23    1230024
Name: JMBAG, dtype: int64

### example 4

Grouping of the data based on the same value of a specific feature(column). In this example the enteries are grouped based on the same grade value, then the number of enteries for each value are counted.

In [35]:
students.groupby('grade').size()

grade
2     2
3    16
4     4
5     3
dtype: int64

### example 5

In this example, .agg() is used alongside .groupby() for two purposes: first, it allows for the usage of non-pandas functions (in this case, np.mean() and np.size()); second, it enables the manipulation of multiple columns.

In [36]:
students.groupby('repeating').agg({
    'grade': np.mean,
    'repeating': np.size
})

              grade  repeating
repeating
0          3.437500         16
1          3.111111          9

### example 6

Updating entries based on some condition(s) using .loc and .iloc. Both work in a similar fashion to boolean indexing shown earlier. \
loc[] is used to select rows and columns by Names/Labels. \
iloc[] is used to select rows and columns by Integer Index/Position. \
In this example, the value of the grade column for students whose grade is 4 is being changed to 4+ using .loc[].

In [1]:
students.loc[students.grade == 4, 'grade'] = '4+'

students

NameError: name 'students' is not defined

Reverting the changes using .iloc[]

In [ ]:
students.iloc[list(students.grade == '4+'), 3] = 4

students

### example 7

Deleting enteries using .loc[].

In [ ]:
first_timers = students.loc[students.repeating != 1]

first_timers

The indexes are no longer in order but are rather kept the same as in the original DataFrame. To fix this, .reset_index() can be used. If the drop parameter is set to False, the index column will be doubled, with the first one being the new one and the second being the old one.

In [ ]:
first_timers = students.loc[students.repeating != 1].reset_index(drop = True)

first_timers

## Storing DataFrame objects

DataFrame objects are very easy to store using the `to_<format>()` functions. They can also be viewed at [https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html). Here are examples of saving a table to text `csv` or `JSON` files and a binary` pickle` file.

In [37]:
filename = "firsttimer.csv"

# save file
first_timers.to_csv(filename)


# read file
print(pd.read_csv(filename))

NameError: name 'first_timers' is not defined

When a .csv is saved using .to_csv(), the index column is saved and doubled when loading using .read_csv().
There are two ways of alleviating this issue:

First is to save the DataFrame without the index.

In [ ]:
first_timers.to_csv(filename, index = False)

print(pd.read_csv(filename))

The second method is to load the .csv while providing information about the location of the saved index.

In [ ]:
first_timers.to_csv(filename)

print(pd.read_csv(filename, index_col = 0))

JSON is a common data format with diverse uses in electronic data interchange, including that of web applications with servers.

In [ ]:
filename = "fisttimers.json"

# save file
first_timers.to_json(filename)

# read file
print(pd.read_json(filename))

Pickling is a way to convert a Python object (list, dictionary, DataFrame etc.) into a character stream. The idea is that this character stream contains all the information necessary to reconstruct the object in another Python script.

In [ ]:
filename = "fisttimers.pkl"

# save file
first_timers.to_pickle(filename)

# read file
print(pd.read_pickle(filename))